In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("train.csv")

In [10]:
s = pd.Series(data = [1,2,3,4,5], index = 'one two three four five'.split())

In [15]:
s

one      1
two      2
three    3
four     4
five     5
dtype: int64

In [12]:
s.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [13]:
df = pd.DataFrame({'name':'Ivanov Petrov Sidorov'.split(),
                   'age':[43, 33, 54]},
                  index = [111, 222, 333])

In [14]:
df

        name  age
111   Ivanov   43
222   Petrov   33
333  Sidorov   54

In [16]:
df['age']

111    43
222    33
333    54
Name: age, dtype: int64

In [18]:
df.name

111     Ivanov
222     Petrov
333    Sidorov
Name: name, dtype: object

In [19]:
#обращение к ячейке: способ 1 (сначала название столбца, потом индекс строки)
df['age'][222]

33

In [21]:
#обращение к ячейке: способ 2 (через аттрибут loc: сначала индекс строки, потом название столбца.) УСТАРЕВШИЙ СПОСОБ
df.loc[222]['age']

33

In [25]:
#обращение к ячейке: способ 3 (через аттрибут loc: сначала порядковый номер строки, потом порядковый номер столбца)
df.iloc[2][1]

54

In [29]:
#обращение к ячейке: способ 4 (комбинация способов 1, 2 и 3)
df.loc[111].iloc[0]

'Ivanov'

In [30]:
df['name'].iloc[2]

'Sidorov'

In [31]:
df = pd.read_csv("train.csv")

In [33]:
#чтобы посмотреть, что в загруженном файле и не выводить весь файл на экран, обычно смотрят первые или последние 5 строк:
df.head()
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

SibSp - количество родственников пассажира (брат, сестра, супруг(а)) на корабле
Parch - количесто детей и родителей пассажира, следовавших с ним на корабле
Ticket - номер билета
Fare - стоимость билета
Cabin - номер каюты
Embarked - порт посадки:
    S - 
    C - 
    Q -

In [34]:
# можно получить общую информацию о файле
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [35]:
# основные статистические показатели относительно ЧИСЛОВЫХ данных файла (строки и другие форматы сюда не попадают)
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [36]:
# чтобы было удобно читать таблицу с малым количеством строк и большим количеством столбцов, повернем ее
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [38]:
# вывести на экран имена, возраст и класс каюты первых десяти пассажиров
df[['Name','Age','Pclass']].head(10)

                                                Name   Age  Pclass
0                            Braund, Mr. Owen Harris  22.0       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1
2                             Heikkinen, Miss. Laina  26.0       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1
4                           Allen, Mr. William Henry  35.0       3
5                                   Moran, Mr. James   NaN       3
6                            McCarthy, Mr. Timothy J  54.0       1
7                     Palsson, Master. Gosta Leonard   2.0       3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0       2

In [40]:
# или так:
df[0:10][['Name','Age','Pclass']]

                                                Name   Age  Pclass
0                            Braund, Mr. Owen Harris  22.0       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1
2                             Heikkinen, Miss. Laina  26.0       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1
4                           Allen, Mr. William Henry  35.0       3
5                                   Moran, Mr. James   NaN       3
6                            McCarthy, Mr. Timothy J  54.0       1
7                     Palsson, Master. Gosta Leonard   2.0       3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0       3
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0       2

In [47]:
# данные о выживших пассажирах 1 класса (первые 10 строк). Условие в [] в pandas называется фильтр.
# отдельные условия должны быть заключены в ()
df[(df['Pclass'] == 1) & (df['Survived'] == 1)].head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C

In [52]:
# найдем минимальную стоимость билета
df['Fare'].min()

0.0

In [58]:
# найдем минимальную стоимость билета отдельно для взрослого и для ребенка
# сначала в [] фильтр, потом в [] обращение к столбцу
df[df['Age'] < 18]['Fare'].min()

7.0542

In [67]:
# найдем возраст самого старшего пассажира с бесплатным билетом
#df[df['Fare'] == 0]['Age'].min()
df[df.Fare == 0].Age.max()

49.0

In [61]:
# минимальная стоимость платных билетов для взрослых
df[(df.Age >=18) & (df.Fare >0)].Fare.min()

4.0125

In [62]:
# число строк в датафрейме
len(df)

891

In [68]:
# средняя стоимость билета в первом классе
df[df.Pclass == 1].Fare.mean()

84.1546875

In [69]:
# средняя стоимость билета в первом классе без учета бесплатных билетов
df[(df.Pclass == 1) & (df.Fare > 0)].Fare.mean()

86.14887440758294

# Группировка данных

## value_counts()

In [70]:
# применим только к Series. Считает сколько уникальных значений и сколько раз каждое из них попадается в столбце
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [71]:
# статистика выживших и погибших среди мужчин
df[df.Sex == 'male'].Survived.value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [72]:
# статистика выживших и погибших среди женщин
df[df.Sex == 'female'].Survived.value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [75]:
# статистика выживших и погибших среди мужчин и женщин
for sex in df.Sex.unique():
    print(f'Данные о {sex}:')
    print(df[df.Sex == sex].Survived.value_counts())
    print()

Данные о male:
0    468
1    109
Name: Survived, dtype: int64

Данные о female:
1    233
0     81
Name: Survived, dtype: int64

In [96]:
# обобщенные данные по классам и полу
for pclass in sorted(df.Pclass.unique()):
    print(f'Класс {pclass}')
    for sex in df.Sex.unique():
        print(sex)
        print(df[(df.Sex == sex) & (df.Pclass == pclass)].Survived.value_counts())
        print()

Класс 1
male
0    77
1    45
Name: Survived, dtype: int64

female
1    91
0     3
Name: Survived, dtype: int64

Класс 2
male
0    91
1    17
Name: Survived, dtype: int64

female
1    70
0     6
Name: Survived, dtype: int64

Класс 3
male
0    300
1     47
Name: Survived, dtype: int64

female
0    72
1    72
Name: Survived, dtype: int64

In [82]:
df[df.Pclass == 1].Survived.value_counts()

1    136
0     80
Name: Survived, dtype: int64